watchdog-in-rust.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-21 Sat 01:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mirai's Watchdog in rust.</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wade mealing" />
<link rel="icon" href="data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%2016%2016'%3E%3Ctext%20x='0'%20y='14'%3EðŸ–¥ï¸%3C/text%3E%3C/svg%3E" type="image/svg+xml" />
</head>
<body>
<div id="content">
<h1 class="title">Mirai's Watchdog in rust.</h1>
<p>
One of the firs tthings that mirai does is disable the watchdog of the
host to ensure that it didnt reboot if the system begins to take too
long.
</p>

<pre class="example">

// Prevent watchdog from rebooting device
if ((wfd = open("/dev/watchdog", 2)) != -1 ||
    (wfd = open("/dev/misc/watchdog", 2)) != -1)
{
    int one = 1;

    ioctl(wfd, 0x80045704, &amp;one);
    close(wfd);
    wfd = 0;
}
</pre>

<p>
Lets break that down,
</p>

<pre class="example">
if ((wfd = open("/dev/watchdog", 2)) != -1 ||
</pre>

<p>
It opens the watchdog device read/write (#define O_RDWR 00000002).
</p>

<p>
It issues an 'ioctl' with a magic number.
</p>
<pre class="example">
ioctl(wfd, 0x80045704, &amp;one);
</pre>

<p>
Then closes the opened file descriptor.
</p>

<pre class="example">
close(wfd);
</pre>

<p>
While this does adhere to the spec, its also not the most supported
method of disabling the watchdog.
</p>

<p>
The aptly named "magic close feature" (<a href="https://www.kernel.org/doc/Documentation/watchdog/watchdog-api.txt">https://www.kernel.org/doc/Documentation/watchdog/watchdog-api.txt</a>))
</p>

<p class="verse">
<br />
Magic Close feature:<br />
<br />
If a driver supports "Magic Close", the driver will not disable the<br />
watchdog unless a specific magic character 'V' has been sent to<br />
/dev/watchdog just before closing the file.  If the userspace daemon<br />
closes the file without sending this special character, the driver<br />
will assume that the daemon (and userspace in general) died, and will<br />
stop pinging the watchdog without disabling it first.  This will then<br />
cause a reboot if the watchdog is not re-opened in sufficient time.<br />
<br />
</p>

<p>
Seems to be more widely supported than the ioctl method. There are
watchdog drivers in the tree that do not support ioctl manipulation,
but instead support the magic close feature.
</p>

<p>
Rust doesn't have a close() function, From the  std::fs::File docs:
</p>

<p class="verse">
Files are automatically closed when they go out of scope. Errors detected on<br />
closing are ignored by the implementation of Drop. Use the method sync_all if<br />
these errors must be manually handled.<br />
</p>

<p>
1This would leave us with a simple function li
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">use</span> <span style="color: #7fffd4;">std</span>::fs;

<span style="color: #00ffff;">fn</span> <span style="color: #87cefa;">disable_watchodg</span><span style="color: #8c8c8c;">()</span> -&gt; <span style="color: #7fffd4;">std</span>::<span style="color: #7fffd4;">io</span>::<span style="color: #98fb98;">Result</span><span style="color: #8c8c8c;">&lt;</span><span style="color: #93a8c6;">()</span><span style="color: #8c8c8c;">&gt;</span> <span style="color: #8c8c8c;">{</span>
    <span style="color: #7fffd4;">fs</span>::write<span style="color: #93a8c6;">(</span><span style="color: #ffa07a;">"/dev/watchdog"</span>, <span style="color: #ffa07a;">"V"</span><span style="color: #93a8c6;">)</span><span style="color: #b0c4de; font-weight: bold;">?</span>
<span style="color: #8c8c8c;">}</span>

<span style="color: #00ffff;">fn</span> <span style="color: #87cefa;">main</span><span style="color: #8c8c8c;">()</span> <span style="color: #8c8c8c;">{</span>
 disable_watchdog<span style="color: #93a8c6;">()</span>;
<span style="color: #8c8c8c;">}</span>
</pre>
</div>

<p>
Wild right ?
</p>

<div id="outline-container-org05be6c0" class="outline-2">
<h2 id="org05be6c0">Additional Resources:</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Wade mealing</p>
<p class="date">Created: 2020-11-21 Sat 01:47</p>
</div>
</body>
</html>
